#include <stdio.h>

int main()
{
    double num1, num2;

    num1 = 1.0;  // num1に1を代入
    num2 = 0.0;  // num2に0を代入

    num2 += 0.1;  // 1回目：0.1を足す
    num2 += 0.1;  // 2回目：0.1を足す
    num2 += 0.1;  // 3回目：0.1を足す
    num2 += 0.1;  // 4回目：0.1を足す
    num2 += 0.1;  // 5回目：0.1を足す
    num2 += 0.1;  // 6回目：0.1を足す
    num2 += 0.1;  // 7回目：0.1を足す
    num2 += 0.1;  // 8回目：0.1を足す
    num2 += 0.1;  // 9回目：0.1を足す
    num2 += 0.1;  // 10回目：0.1を足す

    // num1とnum2の差を小数点以下30桁で表示
    printf("差は %.23f です\n", num1 - num2);
}